inst/book/book.org
#+TITLE: 
#+Author: 

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
options(width=75)
library(BuyseTest)
if(system("whoami",intern=TRUE)=="bozenne"){
  setwd("~/Documents/GitHub/BuyseTest/inst/book/")
}else if(system("whoami",intern=TRUE)=="unicph\\hpl802"){
  setwd("c:/Users/hpl802/Documents/Github/BuyseTest/inst/book/")
}
#+END_SRC

#+RESULTS:
#+begin_example
BuyseTest version 2.4.4

Vedhæfter pakke: 'BuyseTest'

De følgende objekter er maskerede _af_ '.GlobalEnv':

    .calcIntegralCif_cpp, .calcIntegralSurv_cpp, auc, boot2pvalue,
    BuyseMultComp, BuyseTest, BuyseTest.options, BuyseTTEM,
    calcIntegralSurv2_cpp, CasinoTest, constStrata, discreteRoot,
    getCount, getIid, getPairScore, getPseudovalue, getSurvival,
    GPC_cpp, GPC2_cpp, performance, performanceResample,
    powerBuyseTest, sensitivity, simBuyseTest, simCompetingRisks

De følgende objekter er maskerede fra 'package:riskRegression':

    boot2pvalue, discreteRoot
#+end_example

** Section 2.1 Introduction
