inst/book/book.org
*** subsection 2.1.2 Generating in-silico data
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
set.seed(10)
dt.data <- simBuyseTest(100)
dt.data
#+END_SRC

#+RESULTS:
#+begin_example
      id treatment   eventtime status toxicity       score
  1:   1         C 0.445451079      1       no -0.90197026
  2:   2         C 0.183056094      0      yes -0.05474996
  3:   3         C 0.410940283      0       no -1.35675471
  4:   4         C 0.185677294      1      yes  0.31723058
  5:   5         C 0.128177108      0       no  1.39571912
 ---                                                      
196: 196         T 0.137252959      1      yes  1.05104467
197: 197         T 0.008692819      1      yes  1.15579748
198: 198         T 1.668044329      0      yes -1.03443796
199: 199         T 0.112796594      0      yes -0.25446807
200: 200         T 0.196786863      0      yes  1.27368427
#+end_example

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
argsSurv <- list(name = c("OS","PFS"),
                 name.censoring = c("statusOS","statusPFS"),
                 scale.C = c(8.995655, 4.265128),
                 scale.T = c(13.76543, 7.884477),
                 shape.C = c(1.28993, 1.391015),
                 shape.T = c(1.275269, 1.327461),
                 scale.censoring.C = c(34.30562, 20.748712),
                 scale.censoring.T = c(27.88519, 17.484281),
                 shape.censoring.C = c(1.369449, 1.463876),
                 shape.censoring.T = c(1.490881, 1.835526))
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
argsTox <- list(name = "toxicity",
                p.C =  c(1.17, 2.92, 36.26, 39.18, 19.88, 0.59)/100,
                p.T = c(3.51, 4.09, 23.39, 47.37, 21.05, 0.59)/100,
                rho.T = 1, rho.C = 1)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
set.seed(1)
dt.data <- simBuyseTest(n.T = 200, n.C = 200,
                        argsBin = argsTox,
                        argsCont = NULL,
                        argsTTE = argsSurv,
                        level.strata = c("M","F"), names.strata = "gender")
dt.data
#+END_SRC

#+RESULTS:
#+begin_example
      id treatment           OS statusOS        PFS statusPFS toxicity
  1:   1         C  0.628786006        0  0.6946706         1        3
  2:   2         C  0.003647332        1  1.7228221         1        3
  3:   3         C  5.501584752        1  0.9092541         1        3
  4:   4         C  0.286446665        1  5.8723232         1        1
  5:   5         C 17.221063409        1  1.0965019         0        5
 ---                                                                  
396: 396         T 18.771937367        1  1.4219555         0        4
397: 397         T  2.914445864        1 49.5964070         1        3
398: 398         T  1.105391425        1 16.1741055         1        2
399: 399         T  1.318957979        0 10.1102146         1        4
400: 400         T  3.338426913        1 10.9857381         1        3
     gender
  1:      F
  2:      F
  3:      M
  4:      M
  5:      M
 ---       
396:      F
397:      M
398:      M
399:      F
400:      M
#+end_example


#+BEGIN_SRC R :exports both :results output :session *R* :cache no
set.seed(10)
rbind(simBuyseTest(n.T = 100, n.C = 100,
                   argsBin = NULL,
                   argsCont = list(mu.C = 1, mu.T = 2),
                   argsTTE = NULL,
                   prefix.cluster = "M", level.strata = "M", names.strata = "gender"),
      simBuyseTest(n.T = 100, n.C = 100,
                   argsBin = NULL,
                   argsCont = list(mu.C = 10, mu.T = 20),
                   argsTTE = NULL,
                   prefix.cluster = "F", level.strata = "F", names.strata = "gender")
      )
#+END_SRC

#+RESULTS:
#+begin_example
       id treatment      score gender
  1:   M1         C  1.8694750      M
  2:   M2         C  0.3199904      M
  3:   M3         C  1.1732145      M
  4:   M4         C  0.8405620      M
  5:   M5         C  1.7934994      M
 ---                                 
396: F196         T 21.6977207      F
397: F197         T 19.9273100      F
398: F198         T 19.2823911      F
399: F199         T 19.5834856      F
400: F200         T 22.1935868      F
#+end_example


#+BEGIN_SRC R :exports both :results output :session *R* :cache no
dtPC.toxW <- prop.table(table(dt.data$treatment,
                              dt.data$toxicity))
dtPC.toxW * 100
#+END_SRC

#+RESULTS:
:    
:         1     2     3     4     5     6
:   C  2.75  3.25 19.00 12.75  6.75  5.50
:   T  3.75  3.50 12.00 15.75 11.00  4.00

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
library(ggplot2)
ggplot(dt.data, aes(x = toxicity, y = OS, fill = treatment)) + geom_boxplot()
ggplot(dt.data, aes(x = toxicity, y = PFS, fill = treatment)) + geom_boxplot()

library(ggpubr)
ggOS <- ggplot(dt.data, aes(x = toxicity, y = OS, fill = treatment)) + geom_boxplot()
ggOS <- ggOS + theme(text = element_text(size=15), 
                     axis.line = element_line(linewidth = 1.25),
                     axis.ticks = element_line(linewidth = 1.25),
                     axis.ticks.length=unit(.25, "cm"),
                     legend.key.size = unit(3,"line"))
ggPFS <- ggplot(dt.data, aes(x = toxicity, y = PFS, fill = treatment)) + geom_boxplot()
ggPFS <- ggPFS + theme(text = element_text(size=15), 
                       axis.line = element_line(linewidth = 1.25),
                       axis.ticks = element_line(linewidth = 1.25),
                       axis.ticks.length=unit(.25, "cm"),
                       legend.key.size = unit(3,"line"))
ggOSPFS <- ggarrange(ggOS, ggPFS, nrow = 1, ncol = 2, common.legend = TRUE, legend = "bottom")
graphics.off()
pdf("figures/fig_software_OS-PFS-tox.pdf", width = 12, height = 8)
ggOSPFS
dev.off()
#+END_SRC

#+RESULTS:
: null device 
:           1

*** Extra :noexport:
#+BEGIN_SRC R :exports none :results output :session *R* :cache no
dt.prodige[, d_dn2 := as.Date(d_dn, "%d/%m/%Y")]
dt.prodige[, randodt2 := as.Date(randodt, "%d/%m/%Y")]
dt.prodige[, d_progdt2 := as.Date(d_progdt, "%d/%m/%Y")]
dt.prodige[, OS := as.numeric(difftime(d_dn2,randodt2,units="days")/30.44)]
dt.prodige[, PFS := as.numeric(difftime(d_progdt2,randodt2,units="days")/30.44)]

AFT0 <- flexsurvreg(Surv(OS, etat) ~ 1, data = dt.prodige[dt.prodige$bras == "Gemcitabine",], dist = "Weibull")
AFT1 <- flexsurvreg(Surv(OS, etat) ~ 1, data = dt.prodige[dt.prodige$bras == "Folfirinox",], dist = "Weibull")
exp(coef(AFT0))
exp(coef(AFT1))

AFT2 <- flexsurvreg(Surv(PFS, etat) ~ 1, data = dt.prodige[dt.prodige$bras == "Gemcitabine",], dist = "Weibull")
AFT3 <- flexsurvreg(Surv(PFS, etat) ~ 1, data = dt.prodige[dt.prodige$bras == "Folfirinox",], dist = "Weibull")
exp(coef(AFT2))
exp(coef(AFT3))

AFT2.cens <- flexsurvreg(Surv(PFS, etat==0) ~ 1, data = dt.prodige[dt.prodige$bras == "Gemcitabine",], dist = "Weibull")
AFT3.cens <- flexsurvreg(Surv(PFS, etat==0) ~ 1, data = dt.prodige[dt.prodige$bras == "Folfirinox",], dist = "Weibull")
exp(coef(AFT2.cens))
exp(coef(AFT3.cens))
#+END_SRC

#+RESULTS:
#+begin_example
Error: object 'dt.prodige' not found
Error: object 'dt.prodige' not found
Error: object 'dt.prodige' not found
Error: object 'dt.prodige' not found
Error: object 'dt.prodige' not found
Error in flexsurvreg(Surv(OS, etat) ~ 1, data = dt.prodige[dt.prodige$bras ==  : 
  could not find function "flexsurvreg"
Error in flexsurvreg(Surv(OS, etat) ~ 1, data = dt.prodige[dt.prodige$bras ==  : 
  could not find function "flexsurvreg"
Error in h(simpleError(msg, call)) : 
  error in evaluating the argument 'object' in selecting a method for function 'coef': object 'AFT0' not found
Error in h(simpleError(msg, call)) : 
  error in evaluating the argument 'object' in selecting a method for function 'coef': object 'AFT1' not found
Error in flexsurvreg(Surv(PFS, etat) ~ 1, data = dt.prodige[dt.prodige$bras ==  : 
  could not find function "flexsurvreg"
Error in flexsurvreg(Surv(PFS, etat) ~ 1, data = dt.prodige[dt.prodige$bras ==  : 
  could not find function "flexsurvreg"
Error in h(simpleError(msg, call)) : 
  error in evaluating the argument 'object' in selecting a method for function 'coef': object 'AFT2' not found
Error in h(simpleError(msg, call)) : 
  error in evaluating the argument 'object' in selecting a method for function 'coef': object 'AFT3' not found
Error in flexsurvreg(Surv(PFS, etat == 0) ~ 1, data = dt.prodige[dt.prodige$bras ==  : 
  could not find function "flexsurvreg"
Error in flexsurvreg(Surv(PFS, etat == 0) ~ 1, data = dt.prodige[dt.prodige$bras ==  : 
  could not find function "flexsurvreg"
Error in h(simpleError(msg, call)) : 
  error in evaluating the argument 'object' in selecting a method for function 'coef': object 'AFT2.cens' not found
Error in h(simpleError(msg, call)) : 
  error in evaluating the argument 'object' in selecting a method for function 'coef': object 'AFT3.cens' not found
#+end_example

