inst/book/book.org
** section 2.2 Safety or efficacy assessment with GPC

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
dtPC.toxL <- as.data.frame(dtPC.toxW, responseName = "Probability")
names(dtPC.toxL)[1:2] <- c("treatment","grade")
#+END_SRC

#+RESULTS:


#+BEGIN_SRC R :exports both :results output :session *R* :cache no
colorG2R <- scales::seq_gradient_pal(low = rgb(green=0.9,0,0),
                                     high = rgb(red=0.9,0,0))

gg.tox <- ggplot(dtPC.toxL, aes(x = treatment, fill = grade, y = Probability))
gg.tox <- gg.tox + geom_bar(position = position_fill(reverse = TRUE),
                            stat = "identity")
gg.tox <- gg.tox + scale_y_continuous(labels = scales::percent)
gg.tox <- gg.tox + scale_fill_manual("Worse\nadverse event",
                                     values = colorG2R(seq(0,1,length.out=6)))
gg.tox 
#+END_SRC

#+RESULTS:



#+BEGIN_SRC R :exports both :results output :session *R* :cache no
library(prodlim)
plot(prodlim(Hist(OS,statusOS) ~ treatment, data = dt.data))
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R :exports none :results output :session *R* :cache no
pdf("figures/fig_software_hist-tox.pdf", width = 5, height = 5)
gg.tox + theme(text = element_text(size=15), 
                       axis.line = element_line(linewidth = 1.25),
                       axis.ticks = element_line(linewidth = 1.25),
                       axis.ticks.length=unit(.25, "cm"),
                       legend.key.size = unit(2,"line"))
dev.off()
pdf("figures/fig_software_KM-OS.pdf", width = 5, height = 5)
plot(prodlim(Hist(OS,statusOS) ~ treatment, data = dt.data))
dev.off()

#+END_SRC

#+RESULTS:
: X11cairo 
:        2
: X11cairo 
:        2

*** subsection 2.2.1 Binary or continous endpoint

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
dt.data$toxicity.num <- as.numeric(dt.data$toxicity)
eTox.BT <- BuyseTest(treatment ~ cont(toxicity.num, operator = "<0"),
                     data=dt.data)
confint(eTox.BT, statistic = "favorable")
confint(eTox.BT)
#+END_SRC

#+RESULTS:
#+begin_example

         Generalized Pairwise Comparisons

Settings 
   - 2 groups  : Control = C and Treatment = T
   - 1 endpoint: 
       priority endpoint      type        operator           
       1        toxicity.num  continuous  lower is favorable 

Point estimation and calculation of the iid decomposition

Estimation of the estimator's distribution 
   - method: moments of the U-statistic

Gather the results in a S4BuyseTest object
             estimate         se lower.ci  upper.ci null      p.value
toxicity.num  0.35385 0.02808395 0.300924 0.4106169  0.5 9.469156e-07
             estimate         se   lower.ci   upper.ci null   p.value
toxicity.num  -0.0736 0.05617859 -0.1823776 0.03695755    0 0.1917665
#+end_example

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
BuyseTest.options(trace = 0)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
summary(eTox.BT)
#+END_SRC

#+RESULTS:
#+begin_example
       Generalized pairwise comparisons with 1 endpoint

 - statistic       : net benefit (delta: endpoint specific, Delta: global) 
 - null hypothesis : Delta == 0 
 - confidence level: 0.95 
 - inference       : H-projection of order 1
 - treatment groups: T (treatment) vs. C (control) 
 - results
     endpoint total(%) favorable(%) unfavorable(%) neutral(%) uninf(%)   Delta
 toxicity.num      100        35.38          42.74      21.87        0 -0.0736
 CI [2.5% ; 97.5%] p.value 
   [-0.1824;0.037] 0.19177
#+end_example

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
summary(eTox.BT, percentage = FALSE)
#+END_SRC

#+RESULTS:
#+begin_example
       Generalized pairwise comparisons with 1 endpoint

 - statistic       : net benefit (delta: endpoint specific, Delta: global) 
 - null hypothesis : Delta == 0 
 - confidence level: 0.95 
 - inference       : H-projection of order 1
 - treatment groups: T (treatment) vs. C (control) 
 - results
     endpoint total favorable unfavorable neutral uninf   Delta CI [2.5% ; 97.5%] p.value
 toxicity.num 40000     14154       17098    8748     0 -0.0736   [-0.1824;0.037] 0.19177
#+end_example

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
library(asht)
wmwTest(toxicity.num ~ treatment, data = dt.data)
#+END_SRC

#+RESULTS:
#+begin_example

	Wilcoxon-Mann-Whitney test with continuity correction (confidence interval
	requires proportional odds assumption, but test does not)

data:  toxicity.num by treatment
Mann-Whitney estimate = 0.5368, tie factor = 0.94003, p-value = 0.1893
alternative hypothesis: two distributions are not equal
95 percent confidence interval:
 0.4819062 0.5906310
sample estimates:
Mann-Whitney estimate 
               0.5368
#+end_example

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
eTox.BThalf <- BuyseTest(treatment ~ cont(toxicity.num),
                      add.halfNeutral = TRUE,
                      data=dt.data, trace = FALSE)
confint(eTox.BThalf, statistic = "favorable")
#+END_SRC

#+RESULTS:
:              estimate        se  lower.ci  upper.ci null   p.value
: toxicity.num   0.5368 0.0280893 0.4815212 0.5911888  0.5 0.1917665

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
library(pim)
e.pim <- pim(toxicity.num ~ treatment, data = dt.data)
summary(e.pim)
#+END_SRC

#+RESULTS:
#+begin_example
pim.summary of following model : 
 toxicity.num ~ treatment
Type:  difference 
Link:  logit 


           Estimate Std. Error z value Pr(>|z|)
treatmentT   0.1475     0.1126   1.309     0.19

Null hypothesis: b = 0
#+end_example

*** subsection 2.2.2 Threshold of clinical relevance

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
eTox.BT2 <- BuyseTest(treatment ~ cont(toxicity.num, threshold = 2, operator = "<0"),
                     data=dt.data, keep.pairScore = TRUE, trace = FALSE)
print(eTox.BT2)
#+END_SRC

#+RESULTS:
:      endpoint threshold total(%) favorable(%) unfavorable(%) neutral(%) uninf(%)
:  toxicity.num         2      100        19.44          22.14      58.41        0
:   Delta CI [2.5% ; 97.5%] p.value
:  -0.027  [-0.1077;0.0542] 0.51506


#+BEGIN_SRC R :exports both :results output :session *R* :cache no
eTox.BT@threshold
#+END_SRC

#+RESULTS:
: toxicity.num 
:        1e-12

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
getPairScore(eTox.BT2)
#+END_SRC

#+RESULTS:
#+begin_example
       index.C index.T favorable unfavorable neutral uninf weight
    1:       1     201         0           0       1     0      1
    2:       2     201         0           0       1     0      1
    3:       3     201         0           0       1     0      1
    4:       4     201         0           1       0     0      1
    5:       5     201         0           0       1     0      1
   ---                                                           
39996:     196     400         0           0       1     0      1
39997:     197     400         0           1       0     0      1
39998:     198     400         0           0       1     0      1
39999:     199     400         1           0       0     0      1
40000:     200     400         0           0       1     0      1
#+end_example

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
dt.data[c(3:4,201),]
#+END_SRC

#+RESULTS:
:    treatment         OS statusOS        PFS statusPFS toxicity gender toxicity.num
: 1:         C  5.5015848        1  0.9092541         1        3      M            3
: 2:         C  0.2864467        1  5.8723232         1        1      M            1
: 3:         T 13.8301382        1 19.4802921         1        4      F            4

