inst/book/book.tex
\section{section 2.2 Safety or efficacy assessment with GPC}
\label{sec:org7e2d6e6}

\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
dtPC.toxL <- as.data.frame(dtPC.toxW, responseName = "Probability")
names(dtPC.toxL)[1:2] <- c("treatment","grade")
\end{lstlisting}

\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
colorG2R <- scales::seq_gradient_pal(low = rgb(green=0.9,0,0),
                                     high = rgb(red=0.9,0,0))

gg.tox <- ggplot(dtPC.toxL, aes(x = treatment, fill = grade, y = Probability))
gg.tox <- gg.tox + geom_bar(position = position_fill(reverse = TRUE),
                            stat = "identity")
gg.tox <- gg.tox + scale_y_continuous(labels = scales::percent)
gg.tox <- gg.tox + scale_fill_manual("Worse\nadverse event",
                                     values = colorG2R(seq(0,1,length.out=6)))
gg.tox 
\end{lstlisting}

\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
library(prodlim)
plot(prodlim(Hist(OS,statusOS) ~ treatment, data = dt.data))
\end{lstlisting}

\subsection{subsection 2.2.1 Binary or continous endpoint}
\label{sec:orga3bc661}

\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
dt.data$toxicity.num <- as.numeric(dt.data$toxicity)
eTox.BT <- BuyseTest(treatment ~ cont(toxicity.num, operator = "<0"),
                     data=dt.data)
confint(eTox.BT, statistic = "favorable")
confint(eTox.BT)
\end{lstlisting}

\begin{verbatim}

         Generalized Pairwise Comparisons

Settings 
   - 2 groups  : Control = C and Treatment = T
   - 1 endpoint: 
       priority endpoint      type        operator           
       1        toxicity.num  continuous  lower is favorable 

Point estimation and calculation of the iid decomposition

Estimation of the estimator's distribution 
   - method: moments of the U-statistic

Gather the results in a S4BuyseTest object
             estimate         se lower.ci  upper.ci null      p.value
toxicity.num  0.35385 0.02808395 0.300924 0.4106169  0.5 9.469156e-07
             estimate         se   lower.ci   upper.ci null   p.value
toxicity.num  -0.0736 0.05617859 -0.1823776 0.03695755    0 0.1917665
\end{verbatim}

\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
BuyseTest.options(trace = 0)
\end{lstlisting}

\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
summary(eTox.BT)
\end{lstlisting}

\begin{verbatim}
       Generalized pairwise comparisons with 1 endpoint

 - statistic       : net benefit (delta: endpoint specific, Delta: global) 
 - null hypothesis : Delta == 0 
 - confidence level: 0.95 
 - inference       : H-projection of order 1
 - treatment groups: T (treatment) vs. C (control) 
 - results
     endpoint total(%) favorable(%) unfavorable(%) neutral(%) uninf(%)   Delta
 toxicity.num      100        35.38          42.74      21.87        0 -0.0736
 CI [2.5% ; 97.5%] p.value 
   [-0.1824;0.037] 0.19177
\end{verbatim}

\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
summary(eTox.BT, percentage = FALSE)
\end{lstlisting}

\begin{verbatim}
       Generalized pairwise comparisons with 1 endpoint

 - statistic       : net benefit (delta: endpoint specific, Delta: global) 
 - null hypothesis : Delta == 0 
 - confidence level: 0.95 
 - inference       : H-projection of order 1
 - treatment groups: T (treatment) vs. C (control) 
 - results
     endpoint total favorable unfavorable neutral uninf   Delta CI [2.5% ; 97.5%] p.value
 toxicity.num 40000     14154       17098    8748     0 -0.0736   [-0.1824;0.037] 0.19177
\end{verbatim}

\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
library(asht)
wmwTest(toxicity.num ~ treatment, data = dt.data)
\end{lstlisting}

\begin{verbatim}

	Wilcoxon-Mann-Whitney test with continuity correction (confidence interval
	requires proportional odds assumption, but test does not)

data:  toxicity.num by treatment
Mann-Whitney estimate = 0.5368, tie factor = 0.94003, p-value = 0.1893
alternative hypothesis: two distributions are not equal
95 percent confidence interval:
 0.4819062 0.5906310
sample estimates:
Mann-Whitney estimate 
               0.5368
\end{verbatim}

\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
eTox.BThalf <- BuyseTest(treatment ~ cont(toxicity.num),
                      add.halfNeutral = TRUE,
                      data=dt.data, trace = FALSE)
confint(eTox.BThalf, statistic = "favorable")
\end{lstlisting}

\begin{verbatim}
             estimate        se  lower.ci  upper.ci null   p.value
toxicity.num   0.5368 0.0280893 0.4815212 0.5911888  0.5 0.1917665
\end{verbatim}


\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
library(pim)
e.pim <- pim(toxicity.num ~ treatment, data = dt.data)
summary(e.pim)
\end{lstlisting}

\begin{verbatim}
pim.summary of following model : 
 toxicity.num ~ treatment
Type:  difference 
Link:  logit 


           Estimate Std. Error z value Pr(>|z|)
treatmentT   0.1475     0.1126   1.309     0.19

Null hypothesis: b = 0
\end{verbatim}

\subsection{subsection 2.2.2 Threshold of clinical relevance}
\label{sec:org319d7c7}

\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
eTox.BT2 <- BuyseTest(treatment ~ cont(toxicity.num, threshold = 2, operator = "<0"),
                     data=dt.data, keep.pairScore = TRUE, trace = FALSE)
print(eTox.BT2)
\end{lstlisting}

\begin{verbatim}
    endpoint threshold total(%) favorable(%) unfavorable(%) neutral(%) uninf(%)
toxicity.num         2      100        19.44          22.14      58.41        0
 Delta CI [2.5% ; 97.5%] p.value
-0.027  [-0.1077;0.0542] 0.51506
\end{verbatim}



\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
eTox.BT@threshold
\end{lstlisting}

\begin{verbatim}
toxicity.num 
       1e-12
\end{verbatim}


\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
getPairScore(eTox.BT2)
\end{lstlisting}

\begin{verbatim}
       index.C index.T favorable unfavorable neutral uninf weight
    1:       1     201         0           0       1     0      1
    2:       2     201         0           0       1     0      1
    3:       3     201         0           0       1     0      1
    4:       4     201         0           1       0     0      1
    5:       5     201         0           0       1     0      1
   ---                                                           
39996:     196     400         0           0       1     0      1
39997:     197     400         0           1       0     0      1
39998:     198     400         0           0       1     0      1
39999:     199     400         1           0       0     0      1
40000:     200     400         0           0       1     0      1
\end{verbatim}

\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
dt.data[c(3:4,201),]
\end{lstlisting}

\begin{verbatim}
   treatment         OS statusOS        PFS statusPFS toxicity gender toxicity.num
1:         C  5.5015848        1  0.9092541         1        3      M            3
2:         C  0.2864467        1  5.8723232         1        1      M            1
3:         T 13.8301382        1 19.4802921         1        4      F            4
\end{verbatim}
