inst/book/book.org
*** subsection 2.2.3 Accounting for baseline covariates

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
ffG <- treatment ~ cont(toxicity.num, operator = "<0") + strata(gender)
eTox.BTG <- BuyseTest(ffG,
                      data=dt.data, keep.pairScore = TRUE, trace = FALSE)
summary(eTox.BTG)
#+END_SRC

#+RESULTS:
#+begin_example
       Generalized pairwise comparisons with 1 endpoint and 2 strata

 - statistic       : net benefit (delta: endpoint specific, Delta: global) 
 - null hypothesis : Delta == 0 
 - confidence level: 0.95 
 - inference       : H-projection of order 1
 - treatment groups: T (treatment) vs. C (control) 
 - strata weights  : 50.5%, 49.5% 
 - results
     endpoint strata total(%) favorable(%) unfavorable(%) neutral(%) uninf(%)
 toxicity.num global      100        35.43          42.74      21.83        0
                   M       51        17.79          22.37      10.85        0
                   F       49        17.63          20.38      10.98        0
   delta   Delta CI [2.5% ; 97.5%] p.value 
 -0.0731 -0.0731  [-0.1823;0.0379] 0.19672 
 -0.0897                                   
 -0.0561
#+end_example

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
getPairScore(eTox.BTG)
#+END_SRC

#+RESULTS:
#+begin_example
       strata index.C index.T favorable unfavorable neutral uninf weight
    1:      F       1     201         0           1       0     0      1
    2:      F       2     201         0           1       0     0      1
    3:      F       7     201         0           1       0     0      1
    4:      F      11     201         0           1       0     0      1
    5:      F      12     201         0           0       1     0      1
   ---                                                                  
19900:      M     192     400         0           0       1     0      1
19901:      M     195     400         1           0       0     0      1
19902:      M     196     400         0           0       1     0      1
19903:      M     198     400         0           0       1     0      1
19904:      M     199     400         1           0       0     0      1
#+end_example


#+BEGIN_SRC R :exports both :results output :session *R* :cache no
confint(eTox.BTG, stratified = TRUE)
#+END_SRC

#+RESULTS:
:                   estimate         se   lower.ci   upper.ci null   p.value
: toxicity.num.M -0.08973601 0.07926141 -0.2417093 0.06653413    0 0.2601380
: toxicity.num.F -0.05609106 0.08030000 -0.2108224 0.10138233    0 0.4857698

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
e.pimS <- pim(toxicity.num ~ treatment + gender, data = dt.data,
              link = "identity")
coef(e.pimS)
#+END_SRC

#+RESULTS:
:  treatmentT     genderF 
: 0.536970673 0.002438191

#+BEGIN_SRC R :exports none :results output :session *R* :cache no
eTox.BTG2 <- BuyseTest(ffG, data=dt.data, add.halfNeutral = TRUE, trace = FALSE)
coef(eTox.BTG2, statistic = "unfavorable", stratified = TRUE)
#+END_SRC

#+RESULTS:
:   toxicity.num
: M    0.5448680
: F    0.5280455


#+BEGIN_SRC R :exports both :results output :session *R* :cache no
coef(pim(toxicity.num ~ 1+gender, data = dt.data,
         compare = expand.grid(which(dt.data$treatment == "C"),
                               which(dt.data$treatment == "T")),
         link = "identity"))

#+END_SRC

#+RESULTS:
:   (Intercept)       genderF 
:  0.5367438593 -0.0008020101

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
coef(pim(toxicity.num ~ treatment, data = dt.data[dt.data$gender == "M",],
              link = "identity"))
#+END_SRC

#+RESULTS:
: treatmentT 
:   0.544868

