inst/book/book.tex

\subsection{subsection 2.2.3 Accounting for baseline covariates}
\label{sec:org4cd7ef7}

\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
ffG <- treatment ~ cont(toxicity.num, operator = "<0") + strata(gender)
eTox.BTG <- BuyseTest(ffG,
                      data=dt.data, keep.pairScore = TRUE, trace = FALSE)
summary(eTox.BTG)
\end{lstlisting}

\begin{verbatim}
       Generalized pairwise comparisons with 1 endpoint and 2 strata

 - statistic       : net benefit (delta: endpoint specific, Delta: global) 
 - null hypothesis : Delta == 0 
 - confidence level: 0.95 
 - inference       : H-projection of order 1
 - treatment groups: T (treatment) vs. C (control) 
 - strata weights  : 50.5%, 49.5% 
 - results
     endpoint strata total(%) favorable(%) unfavorable(%) neutral(%) uninf(%)
 toxicity.num global      100        35.43          42.74      21.83        0
                   M       51        17.79          22.37      10.85        0
                   F       49        17.63          20.38      10.98        0
   delta   Delta CI [2.5% ; 97.5%] p.value 
 -0.0731 -0.0731  [-0.1823;0.0379] 0.19672 
 -0.0897                                   
 -0.0561
\end{verbatim}

\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
getPairScore(eTox.BTG)
\end{lstlisting}

\begin{verbatim}
       strata index.C index.T favorable unfavorable neutral uninf weight
    1:      F       1     201         0           1       0     0      1
    2:      F       2     201         0           1       0     0      1
    3:      F       7     201         0           1       0     0      1
    4:      F      11     201         0           1       0     0      1
    5:      F      12     201         0           0       1     0      1
   ---                                                                  
19900:      M     192     400         0           0       1     0      1
19901:      M     195     400         1           0       0     0      1
19902:      M     196     400         0           0       1     0      1
19903:      M     198     400         0           0       1     0      1
19904:      M     199     400         1           0       0     0      1
\end{verbatim}


\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
confint(eTox.BTG, stratified = TRUE)
\end{lstlisting}

\begin{verbatim}
                  estimate         se   lower.ci   upper.ci null   p.value
toxicity.num.M -0.08973601 0.07926141 -0.2417093 0.06653413    0 0.2601380
toxicity.num.F -0.05609106 0.08030000 -0.2108224 0.10138233    0 0.4857698
\end{verbatim}


\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
e.pimS <- pim(toxicity.num ~ treatment + gender, data = dt.data,
              link = "identity")
coef(e.pimS)
\end{lstlisting}

\begin{verbatim}
 treatmentT     genderF 
0.536970673 0.002438191
\end{verbatim}


\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
coef(pim(toxicity.num ~ 1+gender, data = dt.data,
         compare = expand.grid(which(dt.data$treatment == "C"),
                               which(dt.data$treatment == "T")),
         link = "identity"))

\end{lstlisting}

\begin{verbatim}
 (Intercept)       genderF 
0.5367438593 -0.0008020101
\end{verbatim}


\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
coef(pim(toxicity.num ~ treatment, data = dt.data[dt.data$gender == "M",],
              link = "identity"))
\end{lstlisting}

\begin{verbatim}
treatmentT 
  0.544868
\end{verbatim}
