inst/book/book.org
*** subsection 2.2.4 Handling right-censoring when assessing efficacy

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
dt.data[,.(censoring=mean(statusOS==0)),by = "treatment"]
#+END_SRC

#+RESULTS:
:    treatment censoring
: 1:         C     0.320
: 2:         T     0.445

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
eEff.BT <- BuyseTest(treatment ~ tte(OS, statusOS), data=dt.data,
                     keep.pairScore = TRUE, trace = FALSE)
print(eEff.BT)
#+END_SRC

#+RESULTS:
:  endpoint total(%) favorable(%) unfavorable(%) neutral(%) uninf(%)  Delta
:        OS      100        58.67          41.12          0      0.2 0.1755
:  CI [2.5% ; 97.5%]   p.value
:    [0.0472;0.2981] 0.0075342

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
getPairScore(eEff.BT)[c(1,2,2623,8553),]
#+END_SRC

#+RESULTS:
:    index.C index.T favorable unfavorable neutral     uninf weight
: 1:       1     201 0.6888801   0.3111199       0 0.0000000      1
: 2:       2     201 1.0000000   0.0000000       0 0.0000000      1
: 3:      23     214 0.0000000   0.8099176       0 0.1900824      1
: 4:     153     243 0.8200000   0.0600000       0 0.1200000      1

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
dt.data[c(1,2,201,23,214,153,243)]
#+END_SRC

#+RESULTS:
:    treatment           OS statusOS          PFS statusPFS toxicity gender
: 1:         C  0.628786006        0  0.694670560         1        3      F
: 2:         C  0.003647332        1  1.722822144         1        3      F
: 3:         T 13.830138195        1 19.480292066         1        4      F
: 4:         C 55.980040009        0  3.154814245         1        6      F
: 5:         T 12.259281475        0  1.993193690         1        4      M
: 6:         C 26.429727212        0  0.017697976         0        6      F
: 7:         T 52.219932416        0  0.003857412         0        6      M

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
print(eEff.BT)
#+END_SRC

#+RESULTS:
:  endpoint total(%) favorable(%) unfavorable(%) neutral(%) uninf(%)  Delta
:        OS      100        58.67          41.12          0      0.2 0.1755
:  CI [2.5% ; 97.5%]   p.value
:    [0.0472;0.2981] 0.0075342

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
eEff.BT2 <- BuyseTest(treatment ~ tte(OS, statusOS), data=dt.data,
                      scoring.rule = "Gehan", keep.pairScore = TRUE, trace = FALSE)
print(eEff.BT2)
#+END_SRC

#+RESULTS:
:  endpoint total(%) favorable(%) unfavorable(%) neutral(%) uninf(%)  Delta
:        OS      100        35.22          24.33          0    40.45 0.1089
:  CI [2.5% ; 97.5%]  p.value
:    [0.0229;0.1934] 0.013205

#+BEGIN_SRC R :exports none :results output :session *R* :cache no
getPairScore(eEff.BT2)[c(1,2,2623,8553),]
#+END_SRC

#+RESULTS:
:    index.C index.T favorable unfavorable neutral uninf weight
: 1:       1     201         0           0       0     1      1
: 2:       2     201         1           0       0     0      1
: 3:      23     214         0           0       0     1      1
: 4:     153     243         0           0       0     1      1

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
dt30.data <- copy(dt.data)
dt30.data[OS>30, c("OS", "statusOS") := .(30,0)]

## plot(prodlim(Hist(OS,statusOS)~treatment, data = dt30.data))
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
eEff.BT30 <- BuyseTest(treatment ~ tte(OS, statusOS, restriction = 25), data=dt30.data,
                       keep.pairScore = TRUE, trace = FALSE)
print(eEff.BT30)
#+END_SRC

#+RESULTS:
:  endpoint restriction total(%) favorable(%) unfavorable(%) neutral(%) uninf(%)
:        OS          25      100        56.22          38.91       4.87        0
:   Delta CI [2.5% ; 97.5%]   p.value
:  0.1731   [0.0468;0.2941] 0.0074591

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
dt.data[c(44,211)]
getPairScore(eEff.BT30)[index.C==44 & index.T == 211,]
getPairScore(eEff.BT)[index.C==44 & index.T == 211,]
#+END_SRC

#+RESULTS:
:    index.C index.T favorable unfavorable neutral uninf weight
: 1:      44     211         0           0       1     0      1
:    index.C index.T favorable unfavorable neutral uninf weight
: 1:      44     211         1           0       0     0      1
:    treatment       OS statusOS      PFS statusPFS toxicity gender
: 1:         C 33.86813        1 5.935977         1        6      F
: 2:         T 34.53610        1 6.308944         1        5      M

** section 2.3 Benefit risk analysis using GPC

