inst/book/book.org
*** subsection 2.3.1 Hierarchical & non-hierarchical analyses
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
eBRB.BT <-BuyseTest(treatment ~ tte(OS, statusOS) + cont(toxicity.num),
                    data=dt.data, trace = FALSE)
print(eBRB.BT)
#+END_SRC

#+RESULTS:
:      endpoint total(%) favorable(%) unfavorable(%) neutral(%) uninf(%)
:            OS    100.0        58.67          41.12       0.00      0.2
:  toxicity.num      0.2         0.05           0.08       0.07      0.0
:    delta  Delta CI [2.5% ; 97.5%]   p.value
:   0.1755 0.1755   [0.0472;0.2981] 0.0075342
:  -0.0003 0.1752   [0.0469;0.2978] 0.0076383

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
eRBB.BT <- BuyseTest(treatment ~ cont(toxicity.num) + tte(OS, statusOS),
                     data=dt.data, trace = FALSE)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
eNH.BT <- BuyseTest(treatment ~ cont(toxicity.num) + tte(OS, statusOS),
                    data=dt.data, hierarchical = FALSE, trace = FALSE)
print(eNH.BT)
#+END_SRC

#+RESULTS:
:      endpoint total(%) favorable(%) unfavorable(%) neutral(%) uninf(%)
:  toxicity.num      100        42.74          35.38      21.87      0.0
:            OS      100        58.67          41.12       0.00      0.2
:   delta  Delta CI [2.5% ; 97.5%]  p.value
:  0.0736 0.0368  [-0.0183;0.0917] 0.190560
:  0.1755 0.1245   [0.0094;0.2365] 0.034154

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
library(ggplot2)
eRBB.plot <- plot(eRBB.BT)
eNH.plot <- plot(eNH.BT)
ggpubr::ggarrange(eRBB.plot$plot + ggtitle("Hierarchical"),
                  eNH.plot$plot + ggtitle("Non-hierarchical"),
                  common.legend = TRUE, legend = "bottom")
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
eRBBNH.plot <- ggpubr::ggarrange(eRBB.plot$plot + ggtitle("Hierarchical") + theme(text = element_text(size=20), 
                                                                                  axis.line = element_line(linewidth = 1.25),
                                                                                  axis.ticks = element_line(linewidth = 1.25),
                                                                                  axis.ticks.length=unit(.25, "cm"),
                                                                                  legend.key.size = unit(2,"line")),
                                 eNH.plot$plot + ggtitle("Non-hierarchical") + theme(text = element_text(size=20), 
                                                                                     axis.line = element_line(linewidth = 1.25),
                                                                                     axis.ticks = element_line(linewidth = 1.25),
                                                                                     axis.ticks.length=unit(.25, "cm"),
                                                                                     legend.key.size = unit(2,"line")),
                                 common.legend = TRUE, legend = "bottom")

pdf("figures/fig_software_hierarchical.pdf", width = 12, height = 8)
eRBBNH.plot
dev.off()
#+END_SRC

#+RESULTS:
: windows 
:       2

*** subsection 2.3.2 Threshold of clinical relevance
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
eSH.BT <- BuyseTest(treatment ~ tte(OS, statusOS, threshold = 28)
                              + cont(toxicity.num, threshold = 2)
                              + tte(OS, statusOS, threshold = 14)
                              + cont(toxicity.num),
                    data=dt.data, trace = FALSE)
print(eSH.BT)
12.59+13.20+11.85+11.23
#+END_SRC

#+RESULTS:
#+begin_example
     endpoint threshold total(%) favorable(%) unfavorable(%) neutral(%)
           OS        28   100.00        17.62           8.66      73.02
 toxicity.num         2    73.72        12.59          13.20      47.93
           OS        14    47.93         6.20           2.88      38.53
 toxicity.num              38.85        11.85          11.23      15.77
 uninf(%)   delta  Delta CI [2.5% ; 97.5%]  p.value
     0.71  0.0897 0.0897  [-0.0014;0.1792] 0.053522
     0.00 -0.0061 0.0835  [-0.0203;0.1855] 0.114665
     0.32  0.0332 0.1168   [0.0033;0.2273] 0.043808
     0.00  0.0062 0.1229    [2e-04;0.2419] 0.049537
[1] 48.87
#+end_example


#+BEGIN_SRC R :exports both :results output :session *R* :cache no
eSH.plot <- plot(eSH.BT, label.endpoint = c("OS\n(\U2265 28 days)","Toxicity\n(\U2265 2 grade)","OS\n(\U2265 14 days)","Toxicity\n(any difference)"))
eBRB.plot <- plot(eBRB.BT, label.endpoint = c("OS\n(any difference)","Toxicity\n(any difference)")) 
eSHBRB.plot <- ggpubr::ggarrange(eBRB.plot$plot + ggtitle("No threshold") + theme(text = element_text(size=20), 
                                                                                  axis.line = element_line(linewidth = 1.25),
                                                                                  axis.ticks = element_line(linewidth = 1.25),
                                                                                  axis.ticks.length=unit(.25, "cm"),
                                                                                  legend.key.size = unit(2,"line")),
                                 eSH.plot$plot + ggtitle("With thresholds") + theme(text = element_text(size=20), 
                                                                                    axis.line = element_line(linewidth = 1.25),
                                                                                    axis.ticks = element_line(linewidth = 1.25),
                                                                                    axis.ticks.length=unit(.25, "cm"),
                                                                                    legend.key.size = unit(2,"line")),
                                 common.legend = TRUE, legend = "bottom", widths = c(1,1.5))
pdf("figures/fig_software_hierarchical-threshold.pdf", width = 12, height = 8)
eSHBRB.plot
dev.off()
#+END_SRC

#+RESULTS:
: windows 
:       2

