inst/book/book.org
*** subsection 2.3.3 Encoding of the outcome
# https://stackoverflow.com/questions/7356120/how-to-properly-document-s4-methods-using-roxygen2
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
dt.data$OS2 <- dt.data$OS
dt.data$OS2[dt.data$statusOS==0] <- 150
#+END_SRC

#+RESULTS:


#+BEGIN_SRC R :exports both :results output :session *R* :cache no
print(BuyseTest(treatment ~ tte(OS2, statusOS), data=dt.data, trace = FALSE))
#+END_SRC

#+RESULTS:
:  endpoint total(%) favorable(%) unfavorable(%) neutral(%) uninf(%)  Delta
:       OS2      100        50.92          34.84          0    14.24 0.1608
:  CI [2.5% ; 97.5%]   p.value
:    [0.0508;0.2669] 0.0042969


#+BEGIN_SRC R :exports both :results output :session *R* :cache no
eD2.BT <- BuyseTest(treatment ~ bin(statusOS, operator = "<0") + tte(OS2, statusOS), data=dt.data, trace = FALSE)
print(eD2.BT)
#+END_SRC

#+RESULTS:
:  endpoint total(%) favorable(%) unfavorable(%) neutral(%) uninf(%)  delta
:  statusOS   100.00        30.26          17.76      51.98     0.00 0.1250
:       OS2    51.98        20.66          17.08       0.00    14.24 0.0358
:   Delta CI [2.5% ; 97.5%]   p.value
:  0.1250   [0.0297;0.2181] 0.0102741
:  0.1608   [0.0508;0.2669] 0.0042969


#+BEGIN_SRC R :exports both :results output :session *R* :cache no
dt.data$toxicity2 <- dt.data$toxicity.num
dt.data$toxicity2[dt.data$statusOS==1] <- -1
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
eBRB2.BT <- BuyseTest(treatment ~ bin(statusOS, operator = "<0") + cont(toxicity2, operator = "<0"), data=dt.data, trace = FALSE)
print(eBRB2.BT)
#+END_SRC

#+RESULTS:
:   endpoint total(%) favorable(%) unfavorable(%) neutral(%) uninf(%)
:   statusOS   100.00        30.26          17.76      51.98        0
:  toxicity2    51.98         4.87           5.70      41.42        0
:    delta  Delta CI [2.5% ; 97.5%]  p.value
:   0.1250 0.1250   [0.0297;0.2181] 0.010274
:  -0.0083 0.1167   [0.0176;0.2135] 0.021043

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
dt.data2 <- rbind(cbind(dt.data[treatment == "C" & statusOS==0,], strata = 1),
                  cbind(dt.data[treatment == "T" & statusOS==0,], strata = 1),
                  cbind(dt.data[treatment == "C" & statusOS==0,], strata = 2),
                  cbind(dt.data[treatment == "T" & statusOS==1,], strata = 2),
                  cbind(dt.data[treatment == "C" & statusOS==1,], strata = 3),
                  cbind(dt.data[treatment == "T" & statusOS==0,], strata = 3)
                  )
eR2.BT <- BuyseTest(treatment ~ cont(toxicity2, operator = "<0"),
                    data=dt.data[statusOS==0], trace = FALSE)
print(eR2.BT, percentage = FALSE)
(1947 - 2279)/40000
#+END_SRC

#+RESULTS:
:   endpoint total favorable unfavorable neutral uninf   Delta
:  toxicity2  5696      1947        2279    1470     0 -0.0583
:  CI [2.5% ; 97.5%] p.value
:    [-0.2378;0.125] 0.53435
: [1] -0.0083

*** subsection 2.3.4 Sensitivity analysis

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
eRBB.Se <- sensitivity(eRBB.BT, threshold = list(1:5,c(0,5,10)),
                       band = TRUE, adj.p.value = TRUE, seed = 10, trace = FALSE)
eRBB.Se[c(1,2,6),]
#+END_SRC

#+RESULTS:
:   toxicity.num OS  estimate         se     lower.ci  upper.ci null
: 1            1  0 0.1274785 0.06066316  0.007314031 0.2440137    0
: 2            2  0 0.1628627 0.06304537  0.037375134 0.2832937    0
: 6            1  5 0.1137239 0.05999122 -0.004903169 0.2291946    0
:      p.value  lower.band upper.band adj.p.value
: 1 0.03765646 -0.01009852  0.2603190  0.07354353
: 2 0.01116991  0.01910242  0.3000252  0.02380337
: 6 0.06020505 -0.02206190  0.2453901  0.11223981

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
eRBB.Hdecomp <- attr(eRBB.Se,"iid")
dim(eRBB.Hdecomp)
eRBB.cor <- cor(eRBB.Hdecomp)
range(eRBB.cor[lower.tri(eRBB.cor)])
rownames(eRBB.cor) <- paste0("tox=",eRBB.Se$toxicity.num,";OS=",eRBB.Se$OS,"")
colnames(eRBB.cor) <- paste0("tox=",eRBB.Se$toxicity.num,";OS=",eRBB.Se$OS,"")
pdf("figures/fig_software_corIID.pdf", width = 8, height = 8)
par(mar  = c(6,6,2,2))
fields::image.plot(eRBB.cor, axes = FALSE)
axis(1, at=(1:15)/15, labels=rownames(eRBB.cor), las = 2)
axis(2, at=(1:15)/15, labels=colnames(eRBB.cor), las = 2)
dev.off()
#+END_SRC

#+RESULTS:
: [1] 400  15
: [1] 0.8247216 0.9999499
: null device 
:           1

#+BEGIN_SRC R :exports none :results output :session *R* :cache no
range(eRBB.Se$adj.p.value/eRBB.Se$p.value)
#+END_SRC

#+RESULTS:
: [1] 1.805953 2.322942

#+BEGIN_SRC R :exports none :results output :session *R* :cache no
sensitivity(eRBB.BT, threshold = expand.grid(toxicity.num = 1:5, OS = c(0,5,10)), trace = FALSE)
#+END_SRC

#+RESULTS:
#+begin_example
   toxicity.num OS  estimate         se     lower.ci  upper.ci null
1             1  0 0.1274785 0.06066316  0.007314031 0.2440137    0
2             2  0 0.1628627 0.06304537  0.037375134 0.2832937    0
3             3  0 0.1734929 0.06404784  0.045806479 0.2956014    0
4             4  0 0.1755467 0.06427418  0.047367941 0.2980378    0
5             5  0 0.1755158 0.06431048  0.047264292 0.2980742    0
6             1  5 0.1137239 0.05999122 -0.004903169 0.2291946    0
7             2  5 0.1490123 0.06054040  0.028770586 0.2650030    0
8             3  5 0.1697035 0.06047587  0.049276124 0.2852674    0
9             4  5 0.1725320 0.06060297  0.051804912 0.2882889    0
10            5  5 0.1726279 0.06063635  0.051832100 0.2884452    0
11            1 10 0.1039310 0.05943866 -0.013461260 0.2184972    0
12            2 10 0.1319955 0.05792578  0.017222911 0.2433348    0
13            3 10 0.1520819 0.05695755  0.038973300 0.2613425    0
14            4 10 0.1580804 0.05691317  0.044980148 0.2671794    0
15            5 10 0.1581505 0.05695809  0.044959183 0.2673325    0
       p.value    lower.band upper.band
1  0.037656458 -0.0101467672  0.2603640
2  0.011169915  0.0190517593  0.3000713
3  0.007951690  0.0271331334  0.3125705
4  0.007478388  0.0286168809  0.3150512
5  0.007522244  0.0285026967  0.3150966
6  0.060205051 -0.0221094323  0.2454348
7  0.015318111  0.0112460019  0.2812268
8  0.005924229  0.0316731865  0.3013820
9  0.005269406  0.0341510747  0.3044220
10 0.005270204  0.0341679720  0.3045860
11 0.082577344 -0.0304672134  0.2346379
12 0.024313439  0.0005313738  0.2589746
13 0.008570478  0.0224791729  0.2766575
14 0.006313026  0.0284741147  0.2824594
15 0.006331924  0.0284397128  0.2826234
#+end_example

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
pdf("figures/fig_software_sensitivity.pdf", width = 12, height = 8)
autoplot(eRBB.Se) + facet_wrap(~OS, labeller = label_both) + theme(text = element_text(size=20), 
                                                                   axis.line = element_line(linewidth = 1.25),
                                                                   axis.ticks = element_line(linewidth = 1.25),
                                                                   axis.ticks.length=unit(.25, "cm"),
                                                                   legend.key.size = unit(2,"line"))
dev.off()
#+END_SRC

#+RESULTS:
: null device 
:           1


#+BEGIN_SRC R :exports both :results output :session *R* :cache no
e.MBT <- BuyseMultComp(list("OS-tox" = eBRB.BT, "tox-OS" = eRBB.BT, "threshold" = eSH.BT), cluster = "id", seed = 10)
e.MBT
#+END_SRC

#+RESULTS:
:   - Univariate tests:
:            estimate         se     lower.ci  upper.ci null     p.value
: OS-tox    0.1751986 0.06432289 0.0469276309 0.2977853    0 0.007638296
: tox-OS    0.1274785 0.06066316 0.0073140314 0.2440137    0 0.037656458
: threshold 0.1229079 0.06195027 0.0002498525 0.2419225    0 0.049537494
:             lower.band upper.band adj.p.value
: OS-tox     0.035735620  0.3079680  0.01162931
: tox-OS    -0.003103986  0.2537864  0.05609444
: threshold -0.010376616  0.2519014  0.07304297

** section 2.4 Power calculation for GPC analyses
