inst/book/book.tex

\subsection{subsection 2.3.3 Encoding of the outcome}
\label{sec:org54c6530}
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
dt.data$OS2 <- dt.data$OS
dt.data$OS2[dt.data$statusOS==0] <- 150
\end{lstlisting}

\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
print(BuyseTest(treatment ~ tte(OS2, statusOS), data=dt.data, trace = FALSE))
\end{lstlisting}

\begin{verbatim}
endpoint total(%) favorable(%) unfavorable(%) neutral(%) uninf(%)  Delta
     OS2      100        50.92          34.84          0    14.24 0.1608
CI [2.5% ; 97.5%]   p.value
  [0.0508;0.2669] 0.0042969
\end{verbatim}



\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
eD2.BT <- BuyseTest(treatment ~ bin(statusOS, operator = "<0") + tte(OS2, statusOS), data=dt.data, trace = FALSE)
print(eD2.BT)
\end{lstlisting}

\begin{verbatim}
endpoint total(%) favorable(%) unfavorable(%) neutral(%) uninf(%)  delta
statusOS   100.00        30.26          17.76      51.98     0.00 0.1250
     OS2    51.98        20.66          17.08       0.00    14.24 0.0358
 Delta CI [2.5% ; 97.5%]   p.value
0.1250   [0.0297;0.2181] 0.0102741
0.1608   [0.0508;0.2669] 0.0042969
\end{verbatim}



\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
dt.data$toxicity2 <- dt.data$toxicity.num
dt.data$toxicity2[dt.data$statusOS==1] <- -1
\end{lstlisting}

\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
eBRB2.BT <- BuyseTest(treatment ~ bin(statusOS, operator = "<0") + cont(toxicity2, operator = "<0"), data=dt.data, trace = FALSE)
print(eBRB2.BT)
\end{lstlisting}

\begin{verbatim}
 endpoint total(%) favorable(%) unfavorable(%) neutral(%) uninf(%)
 statusOS   100.00        30.26          17.76      51.98        0
toxicity2    51.98         4.87           5.70      41.42        0
  delta  Delta CI [2.5% ; 97.5%]  p.value
 0.1250 0.1250   [0.0297;0.2181] 0.010274
-0.0083 0.1167   [0.0176;0.2135] 0.021043
\end{verbatim}


\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
dt.data2 <- rbind(cbind(dt.data[treatment == "C" & statusOS==0,], strata = 1),
                  cbind(dt.data[treatment == "T" & statusOS==0,], strata = 1),
                  cbind(dt.data[treatment == "C" & statusOS==0,], strata = 2),
                  cbind(dt.data[treatment == "T" & statusOS==1,], strata = 2),
                  cbind(dt.data[treatment == "C" & statusOS==1,], strata = 3),
                  cbind(dt.data[treatment == "T" & statusOS==0,], strata = 3)
                  )
eR2.BT <- BuyseTest(treatment ~ cont(toxicity2, operator = "<0"),
                    data=dt.data[statusOS==0], trace = FALSE)
print(eR2.BT, percentage = FALSE)
(1947 - 2279)/40000
\end{lstlisting}

\begin{verbatim}
  endpoint total favorable unfavorable neutral uninf   Delta
 toxicity2  5696      1947        2279    1470     0 -0.0583
 CI [2.5% ; 97.5%] p.value
   [-0.2378;0.125] 0.53435
[1] -0.0083
\end{verbatim}

\subsection{subsection 2.3.4 Sensitivity analysis}
\label{sec:orgbb59c2a}

\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
eRBB.Se <- sensitivity(eRBB.BT, threshold = list(1:5,c(0,5,10)),
                       band = TRUE, adj.p.value = TRUE, seed = 10, trace = FALSE)
eRBB.Se[c(1,2,6),]
\end{lstlisting}

\begin{verbatim}
  toxicity.num OS  estimate         se     lower.ci  upper.ci null
1            1  0 0.1274785 0.06066316  0.007314031 0.2440137    0
2            2  0 0.1628627 0.06304537  0.037375134 0.2832937    0
6            1  5 0.1137239 0.05999122 -0.004903169 0.2291946    0
     p.value  lower.band upper.band adj.p.value
1 0.03765646 -0.01009852  0.2603190  0.07354353
2 0.01116991  0.01910242  0.3000252  0.02380337
6 0.06020505 -0.02206190  0.2453901  0.11223981
\end{verbatim}


\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
eRBB.Hdecomp <- attr(eRBB.Se,"iid")
dim(eRBB.Hdecomp)
eRBB.cor <- cor(eRBB.Hdecomp)
range(eRBB.cor[lower.tri(eRBB.cor)])
rownames(eRBB.cor) <- paste0("tox=",eRBB.Se$toxicity.num,";OS=",eRBB.Se$OS,"")
colnames(eRBB.cor) <- paste0("tox=",eRBB.Se$toxicity.num,";OS=",eRBB.Se$OS,"")
pdf("figures/fig_software_corIID.pdf", width = 8, height = 8)
par(mar  = c(6,6,2,2))
fields::image.plot(eRBB.cor, axes = FALSE)
axis(1, at=(1:15)/15, labels=rownames(eRBB.cor), las = 2)
axis(2, at=(1:15)/15, labels=colnames(eRBB.cor), las = 2)
dev.off()
\end{lstlisting}

\begin{verbatim}
[1] 400  15
[1] 0.8247216 0.9999499
null device 
          1
\end{verbatim}


\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
pdf("figures/fig_software_sensitivity.pdf", width = 12, height = 8)
autoplot(eRBB.Se) + facet_wrap(~OS, labeller = label_both) + theme(text = element_text(size=20), 
                                                                   axis.line = element_line(linewidth = 1.25),
                                                                   axis.ticks = element_line(linewidth = 1.25),
                                                                   axis.ticks.length=unit(.25, "cm"),
                                                                   legend.key.size = unit(2,"line"))
dev.off()
\end{lstlisting}

\begin{verbatim}
null device 
          1
\end{verbatim}



\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
e.MBT <- BuyseMultComp(list("OS-tox" = eBRB.BT, "tox-OS" = eRBB.BT, "threshold" = eSH.BT), cluster = "id", seed = 10)
e.MBT
\end{lstlisting}

\begin{verbatim}
  - Univariate tests:
           estimate         se     lower.ci  upper.ci null     p.value
OS-tox    0.1751986 0.06432289 0.0469276309 0.2977853    0 0.007638296
tox-OS    0.1274785 0.06066316 0.0073140314 0.2440137    0 0.037656458
threshold 0.1229079 0.06195027 0.0002498525 0.2419225    0 0.049537494
            lower.band upper.band adj.p.value
OS-tox     0.035735620  0.3079680  0.01162931
tox-OS    -0.003103986  0.2537864  0.05609444
threshold -0.010376616  0.2519014  0.07304297
\end{verbatim}

\section{section 2.4 Power calculation for GPC analyses}
\label{sec:orgb488ac1}
